from data_sort import data_sort

question = [
  [
    'Александр,карандаш,1',
    'Александр,ручка,2',
    'Иван,карандаш,1',
    'Александр,карандаш,4',
  ],
  [
    'Александр,карандаш,1',
    'Александр,ручка,2',
    'Иван,карандаш,1',
    'Александр,карандаш,4',
    'Андрей,банан,3',
    "Ксюша,кошка,1",
    "Костя,видеокарта,1",
    "Юрий,что-то,1",
 ]
]

answers = [
 {
  'Александр,карандаш,5',
  'Александр,ручка,2',
  'Иван,карандаш,1',
 
 },
  {
  'Иван': {'карандаш': '1'},
  'Александр': {'карандаш': '4'},
  'Андрей': {'банан': '3'},
  'Ксюша': {'кошка': '1'}, 
  'Костя': {'видеокарта': '1'},
  'Юрий': {'что-то': '1'}}
]


def run_tests(questions, answers):
    print(f'{0} from {len(questions)}')
    for i in range(len(questions)):
        assert data_sort(questions[i]) == answers[i]
        print(f'{i + 1} from {len(questions)}')
    print('okay')

run_tests(question, answers)

